#pragma once
#include "Point2d.h"

class WDraw
{

public:

    WDraw(void);
    virtual ~WDraw(void);

    /************************************************************************/
    /* Основной метод отрисовки                                             */
    /************************************************************************/
    virtual void drawSegment(const Point2d& p1, const Point2d& p2) const;

    /************************************************************************/
    /*                                                                      */
    /************************************************************************/
    virtual void drawText(const char* text) const;

};
